#########################################Python程序设计——过程性考核1#########################################
'''
请认真阅读题目要求,按照要求中的语法写代码。
根据提示，将代码写在题目下的空白处
必要的地方请加注释
本考核一共十题，每题10分，此外，根据提交时间的先后顺序，进行相应的减分。
例如：前10位提交的同学，试卷不减分，10～20提交的同学，试卷减5分，20～30名提交的同学，试卷减10分。
两个答卷100%相同的同学，全部为0分。
'''

'''第一题，变量声明
声明一个变量，变量名为：score，为变量赋值为：59.9。'''
#score = 59.9
#变量score的数据类型为：_____

'''第二题，判断语句
判断变量score是否大于60，如果大于，则打印"及格"，如果变量小于60，则打印"不及格"'''



#修改变量score的赋值：70。此时score的数据类型为:____


'''判断score的等级，如果socre大于等于80，则输出"等级为A"，
如果score小于80且大于等于60，则输出"等级为B"，
如果score小于60，则输出"您的成绩为 ,等级为C，请重修！"
注意：打印时，空格处应为实际score的值。'''





'''第三题，判断语句
比较num1,num2,num3的大小，并按照从大到小的顺序输出三个值
'''
num1 = 35
num2 = 183
num3 = 192





'''第四题，循环语句
求100以内所有5的倍数的和
'''




'''第五题，循环语句
求2000到2100间的所有闰年，
闰年的条件：不是整百的年份只要被4整除的就是闰年,整百的年份必须得被400整除才是闰年'''





'''第六题，循环语句
求x、y的最大公约数和最小公倍数'''
x = 36
y = 9




'''第七题，break语句
输出100以内的所有质数'''





'''第八题，break语句
求100内最大的10哥指数的和'''





'''第九题，continue语句
求1-10的所有偶数之和'''






'''第十题，continue语句
输出10-20之间不能被2和3整除的数'''
